import requests  # Імпортуємо бібліотеку requests для виконання HTTP-запитів
from time import time  # Імпортуємо time для вимірювання часу виконання

# Список URL-адрес, з яких будемо отримувати дані
urls = ["http://www.google.com",
        "http://www.python.org", "http://duckduckgo.com"]

# Функція для отримання попереднього перегляду вмісту веб-сторінки


def preview_fetch(url):
    """
    Виконує HTTP-запит GET до вказаного URL і повертає URL разом із першим фрагментом тексту відповіді.

    Аргументи:
        url (str): URL-адреса для запиту.

    Повертає:
        tuple: URL-адреса і перші 150 символів тексту відповіді.
    """
    r = requests.get(url)  # Виконуємо HTTP-запит GET
    # Повертаємо URL та перші 150 символів тексту відповіді
    return url, r.text[:150]


# Основний блок виконання
if __name__ == "__main__":
    """
    Виконує preview_fetch для кожного URL у списку і вимірює загальний час виконання.
    """
    start = time()  # Записуємо час початку виконання
    for url in urls:  # Ітеруємося по кожній URL-адресі в списку
        # Викликаємо функцію preview_fetch для поточного URL
        r = preview_fetch(url)
        print(r)  # Виводимо результат (URL і попередній перегляд вмісту)
    print(time() - start)  # Виводимо час, витрачений на виконання всіх запитів
