import asyncio  # Імпортуємо asyncio для роботи з асинхронними функціями
import random  # Імпортуємо random для генерації випадкових чисел

# Асинхронна функція, яка симулює задачу і повертає випадкове значення


async def random_value():
    """
    Виконує асинхронну задачу з паузою в 1 секунду і повертає випадкове число.

    Повертає:
        float: Випадкове число від 0 до 1.
    """
    print("start task")  # Повідомлення про початок виконання задачі
    await asyncio.sleep(1)  # Асинхронна затримка на 1 секунду
    print("task finished")  # Повідомлення про завершення задачі
    return random.random()  # Повертаємо випадкове число

# Основна асинхронна функція


async def main():
    """
    Використовує asyncio.create_task для виконання задачі і очікує її завершення.
    """
    task = asyncio.create_task(
        random_value())  # Створюємо і запускаємо асинхронну задачу
    print("task scheduled")  # Повідомлення про те, що задача була запланована
    await task  # Очікуємо завершення задачі
    # Отримуємо і виводимо результат виконання задачі
    print(f"result: {task.result()}")

# Основний блок виконання
if __name__ == "__main__":
    # Запускаємо основну асинхронну функцію за допомогою asyncio.run
    asyncio.run(main())
