import asyncio  # Імпортуємо asyncio для роботи з асинхронним програмуванням

# Асинхронна функція task_one


async def task_one():
    """
    Симулює виконання першого завдання із затримкою в 1 секунду.

    Повертає:
        str: Рядок із результатом виконання task_one.
    """
    await asyncio.sleep(1)  # Імітуємо паузу 1 секунду для виконання завдання
    return "результат task_one"  # Повертаємо результат виконання завдання

# Асинхронна функція task_two


async def task_two():
    """
    Симулює виконання другого завдання із затримкою в 2 секунди.

    Повертає:
        str: Рядок із результатом виконання task_two.
    """
    await asyncio.sleep(2)  # Імітуємо паузу 2 секунди для виконання завдання
    return "результат task_two"  # Повертаємо результат виконання завдання

# Основна асинхронна функція


async def main():
    """
    Запускає task_one і task_two паралельно, чекає їх завершення та виводить результати.
    """
    # asyncio.gather запускає обидва завдання паралельно та чекає їх завершення
    results = await asyncio.gather(task_one(), task_two())

    # Виводимо список результатів
    print(results)

# Основний блок виконання
if __name__ == '__main__':
    """
    Запускає основну асинхронну функцію main за допомогою asyncio.run.
    """
    asyncio.run(main())
